
## üìù Day 1 Problem: Expense Tracker

### **Scenario**

#### You want to track your daily expenses for a week. You spend money on categories like **Food, Travel, Entertainment, Shopping, and Others**.

 We‚Äôll create a small dataset (you can expand it later with real data).

---

### **Step 1 ‚Äì Dataset (Expenses for 7 days)**

| Day | Food | Travel | Entertainment | Shopping | Others |
| --- | ---- | ------ | ------------- | -------- | ------ |
| Mon | 250  | 100    | 150           | 200      | 50     |
| Tue | 300  | 80     | 100           | 400      | 20     |
| Wed | 200  | 120    | 0             | 100      | 70     |
| Thu | 350  | 150    | 200           | 250      | 60     |
| Fri | 400  | 200    | 300           | 500      | 100    |
| Sat | 500  | 180    | 400           | 600      | 90     |
| Sun | 450  | 220    | 350           | 300      | 40     |

---

### **Step 2 ‚Äì Tasks**

1. Load this data into **Pandas DataFrame**.
2. Calculate:

   * Total expense per day.
   * Total expense per category.
   * Average daily spending.
   * Day with maximum spending.
3. Use **NumPy** for calculations where possible (sum, mean, max).
4. Visualizations:

   * **Bar chart** of daily expenses (Matplotlib).
   * **Pie chart** of expenses by category (Seaborn/Matplotlib).

---

### **Step 3 ‚Äì Expected Outcome**

* A summary table with daily totals and category totals.
* A bar chart showing how much you spent each day.
* A pie chart showing percentage spending in each category.

---

üëâ Do you want me to **write the full starter Python code** for Day 1 so you can directly run and practice, or should I just give you the problem statement and let you try coding it yourself first?

In [4]:
import pandas as pd

In [5]:
import numpy as np

In [7]:
df = pd.read_excel("Book1.xlsx")

In [8]:
df

   Day  Food  Travel  Entertainment  Shopping  Others
0  Mon   250     100            150       200      50
1  Tue   300      80            100       400      20
2  Wed   200     120              0       100      70
3  Thu   350     150            200       250      60
4  Fri   400     200            300       500     100
5  Sat   500     180            400       600      90
6  Sun   450     220            350       300      40

In [14]:
df["total"] = df[["Food","Travel","Entertainment","Shopping","Others"]].sum(axis=1)

## Total expense per day.

In [15]:
df

   Day  Food  Travel  Entertainment  Shopping  Others  total
0  Mon   250     100            150       200      50    750
1  Tue   300      80            100       400      20    900
2  Wed   200     120              0       100      70    490
3  Thu   350     150            200       250      60   1010
4  Fri   400     200            300       500     100   1500
5  Sat   500     180            400       600      90   1770
6  Sun   450     220            350       300      40   1360

In [19]:
total_expences_per_day = df["total"]

In [18]:
print("Total expense per day", total_expences_per_day)

Total expense per day 0     750
1     900
2     490
3    1010
4    1500
5    1770
6    1360
Name: total, dtype: int64

## Total expense per category

In [22]:
category_wise_total= df[["Food","Travel","Entertainment","Shopping","Others"]].sum(axis=0)

In [23]:
category_wise_total

Food             2450
Travel           1050
Entertainment    1500
Shopping         2350
Others            430
dtype: int64

## Average daily spending.

In [45]:
avg_daily_spending = np.mean(df["total"])

In [46]:
avrage_daily_is

np.float64(1111.4285714285713)

## Day with maximum spending.

In [37]:
index_max = np.argmax(total_expences_per_day)
day = df.loc[index_max,"Day"]
day_with_maximum_spend = np.max(total_expences_per_day)
print("the day with max index is " ,day ,":" , day_with_maximum_spend)
df

the day with max index is  Sat : 1770

   Day  Food  Travel  Entertainment  Shopping  Others  total  total_All
0  Mon   250     100            150       200      50    750        NaN
1  Tue   300      80            100       400      20    900        NaN
2  Wed   200     120              0       100      70    490        NaN
3  Thu   350     150            200       250      60   1010        NaN
4  Fri   400     200            300       500     100   1500        NaN
5  Sat   500     180            400       600      90   1770        NaN
6  Sun   450     220            350       300      40   1360        NaN

1770